{
  "sessionId": "session-d472ea4d-4174-432f-a273-ea213f2ebae4-1760022960944",
  "sourceFile": "master-narratives/session-d472ea4d-4174-432f-a273-ea213f2ebae4-1760022960944.json",
  "storyContext": {
    "narrativeArc": {
      "premise": "Sam Brown is learning to become a Musician",
      "mission": "Help write and play a fun song.",
      "stakes": "Success depends on mastering the skills needed to be a great musician",
      "resolution": "Sam Brown has demonstrated the skills needed to excel as a Musician"
    },
    "companionVoice": {
      "companionId": "sage",
      "greetingStyle": "Harmony greets with a cheerful song.",
      "teachingVoice": "Harmony explains with simple, fun examples.",
      "encouragementStyle": "Harmony cheers with happy words and claps.",
      "transitionPhrasing": "Now, let’s play on!"
    },
    "careerNarrative": {
      "careerIdentity": "Sam Brown is a Musician in training",
      "workplaceSettings": {
        "LEARN": "CareerInc Virtual Academy - Musician Classroom",
        "EXPERIENCE": "CareerInc Musician Studio",
        "DISCOVER": "Concert Hall and Music Park"
      },
      "professionalRole": "Musician Helper",
      "careerGoal": "Sam Brown will help write and play a song for a big event."
    },
    "subjectNarratives": {
      "Math": {
        "careerStoryline": "Watch instructional video and practice how Musicians use counting to play music.",
        "narrativeBridge": "Math skills help musicians calculations and measurements in their daily work",
        "motivationalContext": "Numbers and counting are essential tools in this career"
      },
      "ELA": {
        "careerStoryline": "Watch instructional video and practice reading and writing music words.",
        "narrativeBridge": "Reading and writing help musicians important documents and communications",
        "motivationalContext": "Communication skills make professionals more effective"
      },
      "Science": {
        "careerStoryline": "Watch instructional video and practice how sound works for Musicians.",
        "narrativeBridge": "Science helps musicians understand and improve their work",
        "motivationalContext": "Understanding how things work leads to better problem solving"
      },
      "Social Studies": {
        "careerStoryline": "Watch instructional video and learn how Musicians bring people together.",
        "narrativeBridge": "Musicians serve communities by serving and improving their community",
        "motivationalContext": "Working together and helping others is at the heart of this career"
      }
    },
    "containerTransitions": {
      "toLEARN": "sage says: \"Let's start your musician training in the learning area...\"",
      "toEXPERIENCE": "sage says: \"Now that you've learned the basics, let's apply them in a real musician situation...\"",
      "toDISCOVER": "sage says: \"For this final challenge, you'll need to use ALL your musician skills...\"",
      "conclusion": "sage says: \"You've shown you have what it takes to be a great Musician!\""
    }
  },
  "usage": "Immutable story context passed to all JIT calls for consistent narrative"
}